Revit 2027 API
CoordinationModelLinkData.FileId Property
 The id of the Autodesk Docs item defining this Coordination Model link.
 For a Coordination Model from Autodesk Docs, FileId is the id of the Autodesk Docs item defining this Coordination Model link.
 For a local Coordination Model, FileId has an empty value.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string FileId { get; }
Public ReadOnly Property FileId As String
	Get
public:
property String^ FileId {
	String^ get ();
}
member FileId : string with get
Property Value
String
See Also
Reference
CoordinationModelLinkData Class
Autodesk.Revit.DB.ExternalData Namespace